'''
제출횟수 : 2회
풀이시간 : 2시간 22분

[ 고전한 이유 ]
* 큐브를 돌린 면도 돌아간다는 사실?!?!?!!?!?
* 하드코딩,,,, 백퍼 실수날거라고 생각하고 오만번 채크해도 또 실수하기
* 이 문제는 큐브를 3*3 모양으로 만든게 패착이었다. 코드가 더 길어짐

구상 : 14분
* 하드코딩을 해야한다는걸 부정하는데 걸린 시간

구현 : 26분
디버깅 : 1시간 42분
* 오픈테케 답이 안나옴 계속 하드코딩 한 부분 디버깅하다가 돌린 면도 회전해야한다는 사실을 깨달음
    -> 이때가 1시간 16분이 지났을 무렵,,,
    -> 수정하고 오픈테케 맞아서 제출(2시간이 지났을 무렵,,) -> 틀렸습니다.
* 하드코딩한 부분 디버깅 -> 맞았습니다


[ 시간복잡도 ]
한 번 돌릴때 21개 칸 바꾸기
1000번 까지 돌릴 수 있으니까 대강 1000의 상수배
'''
def rU(d):
    if d=='+':
        F[0], R[0], B[0], L[0] = R[0], B[0], L[0], F[0]
    else :
        F[0], R[0], B[0], L[0] = L[0], F[0], R[0], B[0]

def rD(d):
    if d=='+':
        F[2], R[2], B[2], L[2] = L[2], F[2], R[2], B[2]
    else:
        F[2], R[2], B[2], L[2] = R[2], B[2], L[2], F[2]

def rL(d):
    if d=='+':
        F[0][0], F[1][0], F[2][0], D[0][0], D[1][0], D[2][0], B[2][2], B[1][2], B[0][2], U[0][0], U[1][0], U[2][0] = U[0][0], U[1][0], U[2][0], F[0][0], F[1][0], F[2][0], D[0][0], D[1][0], D[2][0], B[2][2], B[1][2], B[0][2]
    else:
        F[0][0], F[1][0], F[2][0], D[0][0], D[1][0], D[2][0], B[2][2], B[1][2], B[0][2], U[0][0], U[1][0], U[2][0] = D[0][0], D[1][0], D[2][0], B[2][2], B[1][2], B[0][2], U[0][0], U[1][0], U[2][0], F[0][0], F[1][0], F[2][0]

def rR(d):
    if d=='+':
        F[0][2], F[1][2], F[2][2], D[0][2], D[1][2], D[2][2], B[2][0], B[1][0], B[0][0], U[0][2], U[1][2], U[2][2] = D[0][2], D[1][2], D[2][2], B[2][0], B[1][0], B[0][0], U[0][2], U[1][2], U[2][2], F[0][2], F[1][2], F[2][2]
    else:
        F[0][2], F[1][2], F[2][2], D[0][2], D[1][2], D[2][2], B[2][0], B[1][0], B[0][0], U[0][2], U[1][2], U[2][2] = U[0][2], U[1][2], U[2][2], F[0][2], F[1][2], F[2][2], D[0][2], D[1][2], D[2][2], B[2][0], B[1][0], B[0][0]

def rF(d):
    if d=='+':
        U[2][0], U[2][1], U[2][2], R[0][0], R[1][0], R[2][0], D[0][2], D[0][1], D[0][0], L[2][2], L[1][2], L[0][2] = L[2][2], L[1][2], L[0][2], U[2][0], U[2][1], U[2][2], R[0][0], R[1][0], R[2][0], D[0][2], D[0][1], D[0][0]
    else :
        U[2][0], U[2][1], U[2][2], R[0][0], R[1][0], R[2][0], D[0][2], D[0][1], D[0][0], L[2][2], L[1][2], L[0][2] = R[0][0], R[1][0], R[2][0], D[0][2], D[0][1], D[0][0], L[2][2], L[1][2], L[0][2], U[2][0], U[2][1], U[2][2]

def rB(d):
    if d=='+':
        U[0][0], U[0][1], U[0][2], R[0][2], R[1][2], R[2][2], D[2][2], D[2][1], D[2][0], L[2][0], L[1][0], L[0][0] = R[0][2], R[1][2], R[2][2], D[2][2], D[2][1], D[2][0], L[2][0], L[1][0], L[0][0], U[0][0], U[0][1], U[0][2]
    else :
        U[0][0], U[0][1], U[0][2], R[0][2], R[1][2], R[2][2], D[2][2], D[2][1], D[2][0], L[2][0], L[1][0], L[0][0] = L[2][0], L[1][0], L[0][0], U[0][0], U[0][1], U[0][2], R[0][2], R[1][2], R[2][2], D[2][2], D[2][1], D[2][0]


T = int(input())
for _ in range(T):
    U = [['w'] * 3 for _ in range(3)]
    D = [['y'] * 3 for _ in range(3)]
    F = [['r'] * 3 for _ in range(3)]
    B = [['o'] * 3 for _ in range(3)]
    L = [['g'] * 3 for _ in range(3)]
    R = [['b'] * 3 for _ in range(3)]
    dic = {'D': D, 'U': U, 'F':F, 'B': B , 'R': R, 'L': L}
    N = int(input())
    cmd = input().split()
    for c in cmd:
        U, D, F, B, L, R = dic['U'], dic['D'], dic['F'], dic['B'], dic['L'], dic['R']
        s, d = c[0], c[1]
        if s=='F': rF(d)
        elif s=='B': rB(d)
        elif s=='U': rU(d)
        elif s=='D': rD(d)
        elif s=='L' : rL(d)
        else : rR(d)

        arr = dic[s]
        if d=='+':
            arr = list(map(list, zip(*arr)))
            arr=[ele[::-1] for ele in arr]
        else :
            arr = [ele[::-1] for ele in arr]
            arr = list(map(list, zip(*arr)))
        dic[s]=arr

    for ele in dic['U']:
        print(''.join(ele))
